import { Route,Routers, Routes } from 'react-router-dom';
import { useState,useEffect } from 'react';

import './Style.css';
import Slider from './Slider';
import Menu from './Menu';
import Bigview from './Bigview';
import Footer from './Footer';
import EntertainmentPlace from './EntertainmentPlace';
import Action from './Action';
import Food from './Food';
import Hotel from './Hotel';
import Video from './Video';


import image1 from "./Image/slide1.jpg"
import image2 from "./Image/slide2.jpg"
import image3 from "./Image/slide3.jpg"
import image4 from "./Image/slide4.jpg"
import mypicture from "./Image/profile.jpg"
import redhill from "./Image/red hill.jpg"
import mlej from "./Image/mlej.jpg"
import khev from "./Image/onlungkhev.jpg"



function App() {

  const [items, setItems] = useState([
    {
        id:1,
        image : image1,
        title: "មាត់ព្រែកកំពត",
        body: "មាត់ព្រែក កំពត ឬក៏គេច្រើនហៅថា ព្រែកកំពត មានទីតាំងស្ថិតនៅភូមិ១ឧសភា សង្កាត់កំពង់កណ្ដាល ក្រុងកំពត ខេត្តកំពត និងមានចម្ងាយប្រហែល ~1km ពីរង្វង់មូល​ធូរេន។មាត់ព្រែក កំពត ស្ថិតនៅក្នុងប្រភេទ៖ ទេសចរណ៍ធម្មជាតិ។ រីឯចំណុចសំខាន់ៗនៅ មាត់ព្រែក កំពត មានដូចជា៖ ទស្សនាទេសភាពព្រៃភ្នំ, គយគន់ថ្ងៃលិច, គយគន់ថ្ងៃរះ, ស្ទូចត្រី និងចំណុចផ្សេងៗទៀត"
    },
    {
        id:2,
        image: image2,
        title: "រមណីយដ្ឋានដូងទេរ",
        body: "គឺជាកន្លែងកំសាន្តមួយដែលអាចឲ្យបងប្អូនគេចផុតពីភាពតានតឹងដោយសម្រាកលំហែរកាយនៅលើឆ្នេរធម្មជាតិដ៏ស្រស់ស្អាត ថែមទាំងមានការកំសាន្តផ្សេងៗនៅលើទឹក ដូចជាការជិះទូកកៃយ៉ាកជាដើម។ ពេលទៅដល់ទីនោះមានដើមឈើធំៗ ខៀវស្រងាត់ដែលជាម្លប់យ៉ាងត្រជាក់ចិត្តដល់ភ្ញៀវទេសចរណ៍។ ចំណែកឯទេសភាពវិញគឺមានភាពទាក់ទាញ និង អំណោយផលខ្លាំង ដោយសារស្ថិតនៅជាប់ដងព្រែកកំពត ព្រមទាំងមានទេសភាពជួរភ្នំនៅពីខាងមុខផងដែរ ។"
    },
    {
        id:3,
        image: image3,
        title: "ថ្ងៃលិចមាត់ទឹក",
        body: "ថ្ងៃលិចនៅមាត់ទឺក គឺជាថ្ងៃដែលស្រលាញ់ជាងទីមុននៅក្នុងក្រុងឬក្នុងស្រុកដែលមានទីតាំងជាពិសេសមួយ។ វាជាថ្ងៃដែលមានលទ្ធភាពអន្តរក្សាពីភាពជាប់ពិសេសរបស់មនុស្សច្បាស់លាស់ជាមួយទីតាំងដែលខាងក្នុង។ វាត្រូវបានយកជិតទុកជាថ្ងៃសំរាប់ការរីកចម្រើនពីស្រុកនិងដោះស្រាយការពារពេលវេលាដែលមានសមាហរណកម្មប្រចាំឆ្នាំ។ ថ្ងៃនេះគឺជាថ្ងៃពិពណ៌នា និងប្រព័ន្ធរបស់ការរីកចម្រើនទឹកដែលអាចបញ្ចេញពីទីតាំងនេះដោយក្រោមនឹងពីរស្លាកផ្ទាល់ខ្លួនដូចគ្នា។"
    },
    {
        id:4,
        image:image4,
        title: "ភ្នំបូកគោ",
        body: "  បរិយាកាសត្រជាក់ស្រួលនៃភ្នំបូកគោត្រូវបានរកឃើញនៅឆ្នាំ1917 ដោយជនជាតិបារាំងឈ្មោះរូលួស និងត្រូវបាន​អភិវឌ្ឍឲ្យទៅជារមណីយដ្ឋានក្នុងឆ្នាំ1921។កាលពីមុន ភ្នំបូកគោ ធ្លាប់ជាទីកន្លែងសម្រាកដ៏​ល្បីល្បាញ​ដែលធ្វើឡើងសម្រាប់តែ​​​​ អភិជនបារាំង និងរាជវង្សានុវង្សប៉ុណ្ណោះ។ លោក Pham Van Bang ភ្ញៀវទេសចរវៀត​ណាម​ បានទៅទស្សនាភ្នំបូកគោនេះជាលើកដំបូង បានអោយដឹងថា"
    },
    {
        id:5,
        image: mypicture,
        title: "ភ្នំកំពង់ត្រាច",
        body: "ភ្នំកំពង់ត្រាចគឹជាភ្នំមួយដែលស្ថិតនៅតាមផ្លូវជាតិលេខ៣៦ ក្នុង ឃុំដំណាក់កន្ទួតខាងត្បូង ស្រុកកំពង់ត្រាច ចំងាយ ៣៨គីឡូម៉ែត្រ ប៉ែកខាងកើតខេត្តកំពត។ មានទីតាំងនៅស្រុកកំពង់ត្រាច វាគឹជារមណីយដ្ឌានដែលមានភាពស្រស់ស្អាតបែបធម្មជាតិ និង ជាកន្លែងដែលគួអោយចាប់អារម្មណ៍បំផុត របស់ប្រជាពលរដ្ឌ នៅស្រុកកំពង់ត្រាច ហើយក៍បានដឹងឡឹគ្រប់ខេត្ត គ្រប់ស្រុក ព្រមទាំងមានភ្ញៀវទេសចរណ៍បរទេសជាច្រើន បានមកទស្សនាភ្នំកំពង់ត្រាច យ៉ាងច្រើនកុះករពីរមួយឆ្នាំទៅមួយឆ្នាំ។ ហើយប្រជាពលរដ្ឌ ក៍បានអោយដិងថា នៅក្នុងរ៉ូងភ្នំ មានសិលាចរិកជាច្រើន ហើយមានសំឡេងសត្វយំ ទឹកធ្លាក់ និង មាន ភ្នំថ្ម ពុំសូវមានរុក្ខជាតិប៉ុន្មានទេ ជារមណីយដ្ឋានរូងភ្នំ ប្រកបដោយ ល្អាងតូចធំជាច្រើន។"
    },
    {
        id:6,
        image: redhill,
        title: "ជ្រលងភ្នំក្រហម",
        body: "ជ្រលងភ្នំក្រហម មានទីតាំងស្ថិតនៅ ភូមិត្រពាំងក្តារ ឃុំស្រែជាខាងត្បូង ស្រុកដងទង់ ខេត្តកំពត និងមានចម្ងាយប្រហែល ~39km ពីរង្វង់មូល​ធូរេន។ ជ្រលងភ្នំក្រហម ស្ថិតនៅក្នុងប្រភេទ៖ កសិដ្ឋានឬចំការ, ទេសចរណ៍កែច្នៃឬរមណីយដ្ឋានកែច្នៃ។ រីឯចំណុចសំខាន់ៗនៅ ជ្រលងភ្នំក្រហម មានដូចជា៖ បាញ់ព្រួញ, ជិះកង់, ជិះទូក, បោះជំរុំឬបោះតង់, ដើរទស្សនាកសិដ្ឋាន, ស្ទូចត្រី, ឡើងភ្នំ, ទស្សនាចំការម្រេច, ញុំអាហារ, គយគន់ថ្ងៃលិច, ដើរលេងថ្មើរជើង, ទស្សនាទេសភាពព្រៃភ្នំ, ហាត់យ៉ូហ្គាឬធ្វើសមាធិ, ទស្សនាកសិដ្ឋានចិញ្ចឹមសត្វ, ជិះត្រាក់ទ័រសណ្តោងឬរ៉ឺម៉ក, កន្លែងគេង, BBQ និងចំណុចផ្សេងៗទៀត។"
    },
    {
      id:7,
      image: mlej,
      title: "ទំនប់ម្លិច",
      body: "ទំនប់​ម្លិច ផ្លូវ​ចូល​វិញ​មាន​ចម្ងាយ​ប្រមាណ ៦ គ.ម៉. ដោយ​បត់​ស្ដាំ​ចូល​តាម​ផ្លូវ​ដី​មួយ​នៅ​ប្រប​នឹង​ភ្នំ​ប្រមាណ​ ៤ គ.ម៉. នឹង​ទៅ​ដល់​​បន្ទាយ​ទាហាន​ធំ​មួយ បន្ទាប់​មក​​​បត់​ឆ្វេង​ប្រហែល ២ គីឡូម៉ែត្រទៀត​នឹង​ដល់​ហើយ​។​ទំនប់​ម្លិច ជា​​ឈ្មោះ​រមណីយដ្ឋាន​មួយ ដែល​​​មាន​ទីតាំង​ស្ថិត​នៅ ព្រំប្រទល់​រវាង​ខេត្ត​កំពត​និង តាកែវ ក្នុង​ទឹក​ដី ស្ថិត​នៅ​ឃុំ ជ្រេស ស្រុក ជុំគិរី ខេត្ត កំពត មាន​ចម្ងាយ​ប្រមាណ ៩០​គីឡូ​ម៉ែត្រ​ពី​រាជធានី​ភ្នំពេញ ធ្វើ​ដំណើរ​តាម​ផ្លូវ​ជាតិ​លេខ​៣ ដោយ​បទ​​ស្ដាំ​ចូល​​ប្រវែង​ប្រហែល​៦ គីឡូម៉ែត្រ។"
  },
  {
    id:8,
    image: khev,
    title: "ទឹកធ្លាក់អន្លង់​ខៀវ",
    body: "ទឹកធ្លាក់អន្លង់​ខៀវ គឺជារមណីយដ្ឋានមួយកន្លែងដែលមានអាងទឹក​ធម្មជាតិ ដ៏​ថ្លាឈ្វង់ ពណ៌​ខៀវ​ស្រងាត់ អាចអោយយើងលោតទឹកលេង និងហែលទឹកបាន។ វាស្ថិត​នៅ​ផ្នែក​ខាង​លើ​នៃ​សហគមន៍​ទេសចរណ៍​ធម្មជាតិ​ព្រែកត្នោត ឬ​អន្លង់​ធំ ដោយ​ធ្វើ​ដំណើរ​ចេញពី​ទី​រួម​ខេត្ត​កំពត ឆ្ពោះ​ទៅ​កាន់វាលរេញ ក្នុង​ចម្ងាយ​ប្រមាណ​ជិត ៣០ គីឡូម៉ែត្រ ប្រមាណ ៣៥ នាទី។"
},
])




  return (
    <div className="App">
        <Slider />
        <Menu />
        <Bigview />
        <EntertainmentPlace items={items}/>
        <Action />
        <Food />
        <Hotel />
        <Video />


      <Footer />
    </div>
  );
}

export default App;
